{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_SERVICES/CLS_TRAININGS/r12637815",
  "content": "Cut-off saw safety training Online cut-off saw training, with practical knowledge about safety features, risks, preventative measures, and certificate for course completion ### Categories: Home > Products > Services and training > Trainings- - - ### FEATURES: ### TECHNICAL DATA: Product information: Learn how to use gas saws better: get an overview of the features and applications of Hilti gas cut-off saws, then learn how their correct use can lead to safer construction sites. After completing this short, online training course, you will be able to describe the correct preparation for gas saw use, from choosing protective equipment to considering fuel mix. General rules for cutting techniques, storage, transport and maintenance will also be demonstrated. To take the course yourself, select Training for me. To purchase access which you can assign to someone else, select Training for others and input the quantity required. Target Group: Workers, Foremen, HSE Managers Language: English, German, Polish, Romanian, Turkish, French, Spanish, Portuguese, Dutch Technical Data | Target Group | Workers, Foremen, HSE Managers | Language | English, German, Polish, Romanian, Turkish, French, Spanish, Portuguese, Dutch | Duration | 45 minutes | Training method | Online | Training certificate for participants | Yes | Relevant trade | All | Project phase | Execution ### ITEMS- 2302102 - E-learning gas saw - Package Size 1 pc - 2320535 - E-learning cut-off saw team reg. - Package Size 1 pc",
  "tag_name": "Cut-off saw safety training",
  "tag_description": "Online cut-off saw training, with practical knowledge about safety features, risks, preventative measures, and certificate for course completion",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-21T08:59:49.077380",
  "tag_categories_leaf": "Trainings",
  "tag_categories_branch": "Home > Products > Services and training > Trainings",
  "tag_item_numbers": "['2302102', '2320535']",
  "tag_related_files": "[]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r12637815",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}