{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_FASTENER_7135/CLS_TOOLS_FOR_FASTENERS_7135/r14414304",
  "content": "HDE 500-A12 Cordless mortar dispenser Economical, battery-powered adhesive anchor dispenser with precise dosing to help reduce mortar wastage while increasing installation speed and quality ### Categories: Home > Products > Fasteners > Tools for fasteners- - ### FEATURES:Features Cut mortar wastage – dispense with milliliter precision, and use the Hilti Volume Calculator App to find out the ideal dosage setting based on your specific mortar, anchor, embedment depth and drilling diameter Boost installation speed and quality – the simplicity and accuracy of battery-powered mortar dispensers are essential when you want to do it once, do it faster, do it as-designed One-for-all versatility – with the HDE 500-A12, you can use the same electric mortar dispenser with any Hilti adhesive anchor foil pack High-performance cordless tool platform – dispense at least 30 packs of mortar per charge, using the same batteries as all your other Hilti 12V power tools Improve tool return on investment – upgrade from your throwaway manual dispensers: HDE 500-A12 is built to last for at least 700 foil packs Applications Injecting Hilti HIT epoxy or adhesive mortar for fastening anchor rods and rebar in concrete and masonry Dispensing Hilti firestop foams (only when packaged in compatible soft foil packs) ### TECHNICAL DATA: Battery type: 12 V Dispenser type: Battery Technical Data | Battery type | 12 V | Dispenser type | Battery ### ITEMS- 2326713 - Cordl. Dispenser HDE 500-A12 - Package Size 1 pc Package Contents: - 1x HDE 500-A12 Cordl. dispenser assy - 3836589 - HDE 500-A12 W/ BLK & RED CARTRIDGE - Package Size 1 pc Package Contents: - 1x HDE 500-A12 Cordl. dispenser assy - 1x 500ml Cassette black - 1x 500ml Cassette red",
  "tag_name": "HDE 500-A12 Cordless mortar dispenser",
  "tag_description": "Economical, battery-powered adhesive anchor dispenser with precise dosing to help reduce mortar wastage while increasing installation speed and quality",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-20T12:46:39.804343",
  "tag_categories_leaf": "Tools for fasteners",
  "tag_categories_branch": "Home > Products > Fasteners > Tools for fasteners",
  "tag_item_numbers": "['2326713', '3836589']",
  "tag_related_files": "[{'category': 'Operating Instruction', 'url': 'https://productdata.hilti.com/APQ_HC_RAW/PUB_5656287_000.pdf', 'description': 'Download Operating Instruction HDE 500-A12 (01)'}]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r14414304",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}