{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_SERVICES/CLS_TRAININGS/r12637988",
  "content": "Li-ion batteries safety training Online Li-ion battery training with practical knowledge about safety features and risks of cordless power tool batteries, and certificate for course completion ### Categories: Home > Products > Services and training > Trainings- - - ### FEATURES: ### TECHNICAL DATA: Product information: No matter how robust we make them, it is easy to underestimate the potential hazards when working with Li-ion batteries. This short course is ideal for all team members who regularly work with Li-ion batteries, especially hazmat employees responsible for shipping. Participants are shown simple, safety-focused methods for storing, transporting, using and disposing of their power tool batteries. To take the course yourself, select Training for me. To purchase access which you can assign to someone else, select Training for others and input the quantity required. Target Group: Workers, Operators, Installers, Foremen, Site managers, HSE Managers, Management, Warehouse manager and selected employees, Owners Language: English, German, Polish, Romanian, Turkish, French, Spanish, Portuguese, Dutch Technical Data | Target Group | Workers, Operators, Installers, Foremen, Site managers, HSE Managers, Management, Warehouse manager and selected employees, Owners | Language | English, German, Polish, Romanian, Turkish, French, Spanish, Portuguese, Dutch | Duration | 45 minutes | Training method | Online | Training certificate for participants | Yes | Relevant trade | All | Project phase | Execution, Installation ### ITEMS- 2302104 - E-learning Li-Ion battery - Package Size 1 pc - 2320533 - E-learning Li-Ion battery team reg. - Package Size 1 pc",
  "tag_name": "Li-ion batteries safety training",
  "tag_description": "Online Li-ion battery training with practical knowledge about safety features and risks of cordless power tool batteries, and certificate for course completion",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-21T08:59:23.220339",
  "tag_categories_leaf": "Trainings",
  "tag_categories_branch": "Home > Products > Services and training > Trainings",
  "tag_item_numbers": "['2302104', '2320533']",
  "tag_related_files": "[]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r12637988",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}