{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_POWER_TOOL_INSERT_7126/CLS_MULTI_TOOL_INSERTS_7126/r21371928",
  "content": "Multitool grout sanding attachment Carbide sanding disc for the oscillating multitool, for sanding mortar and grout ### Categories: Home > Products > Tool inserts > Multi-tool inserts- ### FEATURES:Features Increased versatility – quickly swap out sanding attachments to cover a range of base materials and applications More sustainable - adapt the Hilti SMT-6 multitool for different applications and base materials by switching inserts, without stocking multiple tools More flexibility – Starlock interface is compatible with all Starlock multitools on the market Easier to change inserts - Starlock compatible interface for a safer and more convenient tool-free insert change Applications Carbide sanding disc for mortar and grout Expand the range of applications possible with the Hilti multitool ### TECHNICAL DATA: Additional Accessory Information: Starlock Carbide grout-abrasive sanding disc, recommended for grout/mortar and plaster. 3 1/2 diameter. Technical Data | Additional Accessory Information | Starlock Carbide grout-abrasive sanding disc, recommended for grout/mortar and plaster. 3 1/2 diameter. ### ITEMS- 2368510 - Sanding disc SMT carbide tipp. - Package Size 1 pc",
  "tag_name": "Multitool grout sanding attachment",
  "tag_description": "Carbide sanding disc for the oscillating multitool, for sanding mortar and grout",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-21T08:57:53.103073",
  "tag_categories_leaf": "Multi-tool inserts",
  "tag_categories_branch": "Home > Products > Tool inserts > Multi-tool inserts",
  "tag_item_numbers": "['2368510']",
  "tag_related_files": "[]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r21371928",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}