{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_POWER_TOOL_INSERT_7126/CLS_MULTI_TOOL_INSERTS_7126/r19423652",
  "content": "Multitool scraper blade High carbon steel (HCS) scraper blade attachment for the oscillating multitool, for scraping paint or glue ### Categories: Home > Products > Tool inserts > Multi-tool inserts- ### FEATURES:Features Increased versatility – quickly insert the scraper attachment to cover a wide range of base materials and applications More sustainable - adapt the Hilti SMT-6 multitool for different applications and base materials by switching inserts, without stocking multiple tools More flexibility – Starlock interface is compatible with all Starlock multitools on the market Easier to change inserts - Starlock compatible interface for a safer and more convenient tool-free insert change Applications Scraping paint, glue, and other soft materials during renovations Expand the range of applications possible with the Hilti multitool ### TECHNICAL DATA: Additional Accessory Information: Starlock HCS scraper blade, recommended for removing glue and paint. 2 width. Technical Data | Additional Accessory Information | Starlock HCS scraper blade, recommended for removing glue and paint. 2 width. ### ITEMS- 2368508 - Scraper SMT HCS - Package Size 1 pc",
  "tag_name": "Multitool scraper blade",
  "tag_description": "High carbon steel (HCS) scraper blade attachment for the oscillating multitool, for scraping paint or glue",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-21T08:55:28.421710",
  "tag_categories_leaf": "Multi-tool inserts",
  "tag_categories_branch": "Home > Products > Tool inserts > Multi-tool inserts",
  "tag_item_numbers": "['2368508']",
  "tag_related_files": "[]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r19423652",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}