{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_POWER_TOOLS_7125/CLS_DRILL_DRIVERS_SCREW_DRIVERS__7125/r17291558",
  "content": "SBT 6-22 Cordless drill driver Steel drilling and driving tool for predrilling accurate holes and installing S-BT screw-in studs (Nuron battery platform) ### Categories: Home > Products > Power tools > Drill drivers and screwdrivers- - - ### FEATURES:Features All you need to install S-BT screw-in studs – SBT 6-22 is Hilti’s specialized metal drill with the high torque and extreme durability needed for fastening on steel Easier precision drilling – Drill Assist feature gives feedback to user when the tapered drill bit has reached the intended depth for S-BT studs No calibration needed – the tool stops automatically once the preset embedment depth has been reached, making correct stud installation quicker and easier Powerful brushless motor – delivering enough torque for all steps of fastening on steel, from drilling the pilot holes to tightening the grating discs or nuts On the Nuron battery platform – cordless tools without compromise thanks to longer-lasting batteries and a range of services to keep you productive, today and tomorrow Applications All-in-one metal drill for installing S-BT fasteners – from drilling highly accurate pilot holes to tightening the fastener Fastening to steel using S-BT screw-in studs – including multipurpose fasteners, grating discs, cable trays and strut Drilling with high torque and speed in diameters up to 13 mm in metal Also suitable for drilling with auger and spade bits up to 32 mm diameter in wood, and cutting with hole saws up to 125 mm diameter Screw-in stud system available in various corrosion resistance levels available, including stainless steel For approval or certificate information, please see individual items. ### TECHNICAL DATA: RPM: 2000 rpm Max. torque: 752.3 in-lbf Chuck type: Keyless chuck Technical Data | RPM | 2000 rpm | Max. torque | 752.3 in-lbf | Chuck type | Keyless chuck ### ITEMS- 3904137 - SBT 6 Drill & Drive Package M8 - Package Size 1 pc Package Contents: - 2x SBT 6-22 (03) Cordl. drill driver - 2x Inspection card S-IC BT - 1x C 4-22 02 110-127V Battery charger - 1x Nut setter S-NS 13 C 95/3 3/4 - 2x S-SH BT M8 Stud holder - 3x Inspection card S-IC BT - 3x B 22-55 Li-ion Battery pack - 1x Tool bag medium - 3904138 - SBT 6 Drill & Drive Package W10 - Package Size 1 pc Package Contents: - 2x SBT 6-22 (03) Cordl. drill driver - 2x Inspection card S-IC BT - 1x C 4-22 02 110-127V Battery charger - 1x Nut setter S-NS 9/16 C 95/3 3/4 - 2x S-SH BT M10/W10 Stud holder - 3x Inspection card S-IC BT - 3x B 22-55 Li-ion Battery pack - 1x Tool bag medium - 2363097 - Cordl. drill driver SBT 6-22 - Package Size 1 pc Package Contents: - 1x SBT 6-22 (03) Cordl. drill driver - 1x Inspection card S-IC BT",
  "tag_name": "SBT 6-22 Cordless drill driver",
  "tag_description": "Steel drilling and driving tool for predrilling accurate holes and installing S-BT screw-in studs (Nuron battery platform)",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-21T08:53:20.053197",
  "tag_categories_leaf": "Drill drivers and screwdrivers",
  "tag_categories_branch": "Home > Products > Power tools > Drill drivers and screwdrivers",
  "tag_item_numbers": "['3904137', '3904138', '2363097']",
  "tag_related_files": "[]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r17291558",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}