{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_POWER_TOOLS_7125/CLS_SAWS_7125/r13250367",
  "content": "SC 4WL-22 Cordless circular saw Cordless circular saw with maximized run time per charge for fast, straight cuts in wood up to 57 mm│2-1/4” depth (Nuron battery platform) ### Categories: Home > Products > Power tools > Saws- - - ### FEATURES:Features Maximized run time per charge – revolutionary Nuron batteries help you to get more done without stopping to change battery More consistent cutting speed – optimized batteries and motor delivering the power you need, no matter what the material demands Designed for more efficient, accurate cutting – ergonomic grips and guiderail compatibility help you make straight, accurate cuts faster Virtually dust-free sawing – when used with included dust port to connect the cordless circular saw to a Hilti vacuum cleaner On the Nuron battery platform – cordless circular saws without compromise thanks to longer-lasting batteries, energy-saving blades and a range of services to keep you more productive, today and tomorrow Applications Cutting formwork boards, OSB, plywood, chipboard, plastics, rafters and battens Interior finishing – cutting drywall board, cement board, MDF and HDF Trimming and fitting wood and sheet materials Ripping and crosscutting as well as bevel and miter cuts Fast, straight cuts up to 2-1/4” depth in wood and other board ### TECHNICAL DATA: Max. cutting depth: 2.24 in Blade diameter: 6.5 in Base material: Wood Technical Data | Max. cutting depth | 2.24 in | Blade diameter | 6.5 in | Base material | Wood | Guiding rail compatibility | Yes | Dimensions (LxWxH) | 14.1 x 7.9 x 9.4 mm | Cutting depth at 45 degrees | 1-21/32 in | Max. bevel angle | 50 ° | Tool body weight | 6.6 lb | Maximum Cross Cut Capacity | x ### ITEMS- 3782607 - SC 4WL-22 WOOD CIRCULAR SAW KIT - Package Size 1 pc Package Contents: - 1x SC 4WL-22 Cordl. circular saw - 1x Circ. saw blade SCBW FR SPX 6-1/2 A - 1x C 4-22 02 110-127V Battery charger - 2x B 22-85 Li-ion Battery pack - 1x Tool bag medium - 2237130 - Cordl. circular saw SC 4WL-22 box - Package Size 1 pc Package Contents: - 1x SC 4WL-22 Cordl. circular saw - 1x Circ. saw blade SCBW FR SPX 6-1/2 A",
  "tag_name": "SC 4WL-22 Cordless circular saw",
  "tag_description": "Cordless circular saw with maximized run time per charge for fast, straight cuts in wood up to 57 mm│2-1/4” depth (Nuron battery platform)",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-21T09:03:40.800556",
  "tag_categories_leaf": "Saws",
  "tag_categories_branch": "Home > Products > Power tools > Saws",
  "tag_item_numbers": "['3782607', '2237130']",
  "tag_related_files": "[]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r13250367",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}