{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_POWER_TOOLS_7125/CLS_SAWS_7125/r18202479",
  "content": "SC 6WL-22 Cordless Circular Saw for wood Cordless circular saw for wood cutting up to 60 mm | 2-3/8 with a faster 165 mm | 6-1/2 diameter universal wood saw blade ### Categories: Home > Products > Power tools > Saws- - - ### FEATURES:Features Longer battery reach - the combination of the brushless motor and the universal wood blade provide less downtime and more productivity per charge Increased dust capture rate – exposure to harmful fine dust is reduced thanks to the new dust channel Designed for more efficient, accurate cutting – the ergonomic design, compact shape and light weight help you make straight, accurate cuts faster Faster cutting speed - the brushless motor combined with a 6-1/2” universal wood blade result in increased cutting speed 2-3/8 cutting depth covers most of the applications you need Applications Cutting formwork boards, OSB, plywood, chipboard, plastics, rafters, and battens Interior finishing – cutting plasterboard, MDF and HDF Trimming and fitting wood and sheet materials Ripping and crosscutting as well as bevel and miter cuts Faster, straighter cuts up to 2-3/8 depth in wood and other boards ### TECHNICAL DATA: Max. cutting depth: 2.38 in Blade diameter: 6-1/2 in Base material: Chipboard, Drywall, Fibre board, Fibre cement board, Gypsum, Gypsum board, Gypsum fiber, Hardwood (beech, oak etc.), High pressure laminate, Laminated board, Plastic, Plexiglass, Plywood, Softwood (fir, pine etc.), Wood, Wood composites, Wood core plywood Technical Data | Max. cutting depth | 2.36 in | Blade diameter | 6-1/2 in | Base material | Chipboard, Drywall, Fibre board, Fibre cement board, Gypsum, Gypsum board, Gypsum fiber, Hardwood (beech, oak etc.), High pressure laminate, Laminated board, Plastic, Plexiglass, Plywood, Softwood (fir, pine etc.), Wood, Wood composites, Wood core plywood | No load RPM | gear 1: 4500 rpm | Guiding rail compatibility | No | Dimensions (LxWxH) | 11-21/32 x 6-5/8 x 9-31/32 in | Cutting depth at 45 degrees | 1-9/16 in | Max. bevel angle | 50 ° | Tool body weight | 5.7 lb | Maximum Cross Cut Capacity | x ### ITEMS- 2326033 - SC 6WL-22 Cordless Circular Saw - Package Size 1 pc Package Contents: - 1x SC 6WL-22 USA Cordl. circular saw - 1x SCBW FR SPX 61/2 A Circ. saw blade - 1x Parallel guide",
  "tag_name": "SC 6WL-22 Cordless Circular Saw for wood",
  "tag_description": "Cordless circular saw for wood cutting up to 60 mm | 2-3/8 with a faster 165 mm | 6-1/2 diameter universal wood saw blade",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-20T12:21:35.773071",
  "tag_categories_leaf": "Saws",
  "tag_categories_branch": "Home > Products > Power tools > Saws",
  "tag_item_numbers": "['2326033']",
  "tag_related_files": "[{'category': 'Operating Instruction', 'url': 'https://productdata.hilti.com/APQ_HC_RAW/PUB_5744554_000.pdf', 'description': 'Download Operating Instruction SC 6WL-22 (01)'}]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r18202479",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}