{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_POWER_TOOLS_7125/CLS_SAWS_7125/r18202478",
  "content": "SC 6WP-22 Cordless plunge saw Precision plunge circular saw with high dust capture rate for clean and controlled, straight cuts in wood up to 53 mm│2-1/8” depth with guiderail ### Categories: Home > Products > Power tools > Saws- - - ### FEATURES:Features Precision cutting – adjustable bevel, incremental 1mm depth adjustment, and guiderail for accurate cuts and line alignment Virtually dust-free sawing – optimized dust and wood chip capture to reduce harmful dust inhalation and save time on clean-up Designed for smoother, safer, more accurate cuts –ergonomic grips, parallel guide, guiderail compatible, and fully concealed blade when idle Faster cutting speed - perfectly paired with our universal wood blade for optimized cutting speed, battery life, and performance On the Nuron battery platform – cordless plunge saw without compromise thanks to longer-lasting batteries, energy-saving blades, and a range of services to keep you more productive, today and tomorrow Applications Blade portfolio, for a wide range of materials such as wood boards, drywall, and fiber cement boards Building construction, for large cut-outs and beveling of structural and wall elements Interior finishing, precision cut-outs and fine finish blade for virtually splinter-free edges Versatile alternative to table saw for straight cuts with guiderail, long bevel cuts, and sizing sheet goods on site ### TECHNICAL DATA: Max. cutting depth: 2.24 in Blade diameter: 6-1/2 in Base material: Chipboard, Drywall, Fibre board, Fibre cement board, Gypsum board, Gypsum fiber, Hardwood (beech, oak etc.), High pressure laminate, Laminated board, Plastic, Plexiglass, Plywood, Softwood (fir, pine etc.), Timber, Wood, Wood composites, Wood core plywood Technical Data | Max. cutting depth | 2.24 in | Blade diameter | 6-1/2 in | Base material | Chipboard, Drywall, Fibre board, Fibre cement board, Gypsum board, Gypsum fiber, Hardwood (beech, oak etc.), High pressure laminate, Laminated board, Plastic, Plexiglass, Plywood, Softwood (fir, pine etc.), Timber, Wood, Wood composites, Wood core plywood | No load RPM | gear 1: 6000 rpm | Guiding rail compatibility | Yes | Dimensions (LxWxH) | 14-5/32 x 7-7/8 x 9-5/16 in | Cutting depth at 45 degrees | 1-5/8 in | Max. bevel angle | 47 ° | Tool body weight | 7.3 lb | Maximum Cross Cut Capacity | x ### ITEMS- 3900571 - SC 6WP Kit + Guide Rail - Package Size 1 pc Package Contents: - 1x SC 6WP-22 (US) Cordl. circular saw - 1x SC 6WP-22 Tool case assy - 1x Circ. saw blade SCBF PCD SPX 6 1/2 - 1x Circ. saw blade SCBW FF SPX 6 1/2 - 1x Parallel guide SC 6WP-22 - 1x Dust bag SC 6WP-22 - 2x SCREW CLAMP - 1x SC GR + WGS assy Connector - 1x WGS 1400-2 Soft Pouch - 2x SC GR-1400 Guide rail assy - 3900570 - SC 6WP Kit - Package Size 1 pc Package Contents: - 1x SC 6WP-22 (US) Cordl. circular saw - 1x SC 6WP-22 Tool case assy - 1x Circ. saw blade SCBF PCD SPX 6 1/2 - 1x Circ. saw blade SCBW FF SPX 6 1/2 - 1x Parallel guide SC 6WP-22 - 1x Dust bag SC 6WP-22 - 2402521 - Cordl. circular saw SC 6WP-22 case - Package Size 1 pc Package Contents: - 1x SC 6WP-22 (US) Cordl. circular saw - 1x SC 6WP-22 Tool case assy",
  "tag_name": "SC 6WP-22 Cordless plunge saw",
  "tag_description": "Precision plunge circular saw with high dust capture rate for clean and controlled, straight cuts in wood up to 53 mm│2-1/8” depth with guiderail",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-20T12:27:21.485451",
  "tag_categories_leaf": "Saws",
  "tag_categories_branch": "Home > Products > Power tools > Saws",
  "tag_item_numbers": "['3900571', '3900570', '2402521']",
  "tag_related_files": "[{'category': 'Operating Instruction', 'url': 'https://productdata.hilti.com/APQ_HC_RAW/PUB_5792304_000.pdf', 'description': 'Download Operating Instruction SC 6WP-22 (01)'}]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r18202478",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}