{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_POWER_TOOLS_7125/CLS_SAWS_7125/r17484560",
  "content": "SC 6ML-22 Cordless circular saw for metal Cold-cutting cordless metal saw for extra-fast, precision cutting up to 60 mm│2-3/8” depth (Nuron battery platform) ### Categories: Home > Products > Power tools > Saws- - - ### FEATURES:Features Cold cut metal saw – exceptionally smooth, fewer sparks in metal/stainless cuts, and the base material remains cool when cut with TCT blades Comprehensive safety features – low-noise sawing with chip collector and rapid blade brake help to minimize the hazards on your jobsites Suitable for straight and pipe cutting – expand the functionality of your cordless circular saw for metal by adding an optional guiderail or pipe adapter Hilti’s best-ever metal cutting circular saw for 6-1/2” blades – doubled cutting speed thanks to Nuron technology and a powerful brushless motor Better handling – low weight of just 7 lbs (inc. B 22-85 battery), ergonomic grips and LED work light help you to slice quickly through your cutting line Applications Cutting channels, pipes, conduits and profiles up to a depth of 60mm (2-3/8) Cutting openings in sheet metal for heating and air conditioning installation Cutting sandwich panels, mesh and corrugated sheet metal Corrective cutting and trimming of sheet metal Fast, precise cuts up to 2-3/8 in metal ### TECHNICAL DATA:Max. cutting depth: 2.36 inBlade diameter: 6.5 inBase material: Metal, Steel, Stainless steel, Non-ferrous metal Technical Data | Max. cutting depth | 2.36 in | Blade diameter | 6.5 in | Base material | Metal, Steel, Stainless steel, Non-ferrous metal | No load RPM | gear 1: 4000 rpm | Guiding rail compatibility | Yes | Max. bevel angle | 0 ° | Maximum Cross Cut Capacity | x ### ITEMS- 3884096 - SC 6ML with XCut Blade Combo - Package Size 1 pc Package Contents: - 1x SC 6ML-22 USA Cordl. circular saw - 1x SCBM XCut Struct 6.5 A Circ. saw blade - 1x Parallel guide - 2x Circ. saw blade SCBM MU Steel 6.5",
  "tag_name": "SC 6ML-22 Cordless circular saw for metal",
  "tag_description": "Cold-cutting cordless metal saw for extra-fast, precision cutting up to 60 mm│2-3/8” depth (Nuron battery platform)",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-20T12:18:54.134674",
  "tag_categories_leaf": "Saws",
  "tag_categories_branch": "Home > Products > Power tools > Saws",
  "tag_item_numbers": "['3884096']",
  "tag_related_files": "[{'category': 'Operating Instruction', 'url': 'https://productdata.hilti.com/APQ_HC_RAW/PUB_5744561_000.pdf', 'description': 'Download Operating Instruction SC 6ML-22 (01)'}]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r17484560",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}