{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_SERVICES/CLS_TRAININGS/r12637812",
  "content": "Silica Dust Competent Person training Online training for the role of Dust Competent Person, with practical knowledge, corrective measures, role responsibilities and certificate for course completion ### Categories: Home > Products > Services and training > Trainings- - - ### FEATURES: ### TECHNICAL DATA: Product information: The course provides thorough training on the potential dangers of silica dust and OSHA standards for dust safety during construction work. It is recommended for anyone designated a Competent Person on respirable crystalline silica hazards. Participants gain practical knowledge on dust exposure avoidance, corrective measures and their responsibilities as the jobsite’s Competent Person. To take the course yourself, select Training for me. To purchase access which you can assign to someone else, select Training for others and input the quantity required. Target Group: HSE Managers, Foremen, Site managers Language: English, Spanish, French Technical Data | Target Group | HSE Managers, Foremen, Site managers | Language | English, Spanish, French | Duration | 45 minutes | Training method | Online | Training certificate for participants | Yes | Relevant trade | All | Project phase | Execution, Installation ### ITEMS- 2302128 - E-learning silica competent person - Package Size 1 pc - 2320259 - E-learning silica compet. pers. team reg - Package Size 1 pc",
  "tag_name": "Silica Dust Competent Person training",
  "tag_description": "Online training for the role of Dust Competent Person, with practical knowledge, corrective measures, role responsibilities and certificate for course completion",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-21T08:59:41.373608",
  "tag_categories_leaf": "Trainings",
  "tag_categories_branch": "Home > Products > Services and training > Trainings",
  "tag_item_numbers": "['2302128', '2320259']",
  "tag_related_files": "[]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r12637812",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}