{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_SERVICES/CLS_TRAININGS/r12637820",
  "content": "Silica dust safety awareness training Online silica dust safety training with practical knowledge about long- and short-term risks, preventative measures, and certificate for course completion ### Categories: Home > Products > Services and training > Trainings- - - ### FEATURES: ### TECHNICAL DATA: Product information: Essential safety training for all construction professionals who work with concrete and masonry. Learn about the dangers of exposure to silica dust, and how to better avoid them while cutting, grinding, slitting or breaking. In under one hour, participants experience ways to reduce dust at source. The result is a team equipped to better protect their health, and work effectively while taking precautions. To take the course yourself, select Training for me. To purchase access which you can assign to someone else, select Training for others and input the quantity required. Target Group: Workers, Installers, Operators, Foremen, HSE Managers, Site managers Language: English, Spanish, French Technical Data | Target Group | Workers, Installers, Operators, Foremen, HSE Managers, Site managers | Language | English, Spanish, French | Duration | 45 minutes | Training method | Online | Training certificate for participants | Yes | Relevant trade | All | Project phase | Execution, Installation ### ITEMS- 2302111 - E-learning silica dust awareness - Package Size 1 pc - 2320544 - E-learning dust awareness team reg. - Package Size 1 pc",
  "tag_name": "Silica dust safety awareness training",
  "tag_description": "Online silica dust safety training with practical knowledge about long- and short-term risks, preventative measures, and certificate for course completion",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-21T08:59:45.544518",
  "tag_categories_leaf": "Trainings",
  "tag_categories_branch": "Home > Products > Services and training > Trainings",
  "tag_item_numbers": "['2302111', '2320544']",
  "tag_related_files": "[]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r12637820",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}