{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_POWER_TOOLS_7125/CLS_JOBSITE_ESSENTIALS_7125/r13275667",
  "content": "SL 6-22 LED construction light Cordless LED construction light with all-day battery life, rotating head and mounting options for multi-person work areas (Nuron battery platform) ### Categories: Home > Products > Power tools > Jobsite essentials- ### FEATURES:Features Works virtually anywhere – the 360° rotating head can stand, hang, hook or be attached to a standard tripod while staying cool to the touch Low battery warning – the construction light maintains constant brightness, but will warn you of low batteries with enough time to get to a charger On the Nuron battery platform – cordless LED construction lights without compromise thanks to longer-lasting batteries and a range of services to keep you more productive, today and tomorrow Clearer visibility – four specially engineered LEDs deliver even, natural light color in three brightness levels across an area large enough for two workers (illumination up to 3000 lumens/2100 Lux at 3 ft distance) Applications Illumination of unlit and poorly lit rooms and work areas – can be hung from or attached to a wide range of objects nearby, such as pipes and scaffolds Overhead lighting when hung from pipes, rafters, strut, etc. using the hook-shaped legs – downward light minimizes the shadows Stand lighting when attached to a tripod using the 5/8 thread attachment point Suitable for use in confined spaces (housing stays cool to the touch and LEDs don’t emit extreme heat) ### TECHNICAL DATA: Brightness: 3000 lm Technical Data | Brightness | 3000 lm ### ITEMS- 2242907 - Cordl. area light SL 6-22 - Package Size 1 pc Package Contents: - 1x SL 6-22 Cordl. area light",
  "tag_name": "SL 6-22 LED construction light",
  "tag_description": "Cordless LED construction light with all-day battery life, rotating head and mounting options for multi-person work areas (Nuron battery platform)",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-20T12:47:48.360364",
  "tag_categories_leaf": "Jobsite essentials",
  "tag_categories_branch": "Home > Products > Power tools > Jobsite essentials",
  "tag_item_numbers": "['2242907']",
  "tag_related_files": "[{'category': 'Operating Instruction', 'url': 'https://productdata.hilti.com/APQ_HC_RAW/PUB_5664351_000.pdf', 'description': 'Download Operating Instruction SL 6-22 (02)'}]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r13275667",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}