{
  "tag_heading": "na",
  "tag_public_url": "https://www.hilti.com/c/CLS_POWER_TOOL_INSERT_7126/CLS_SAW_BLADES_7126/r8024490",
  "content": "Wood framing circular saw blade Top-performance circular saw blade for wood framing with carbide teeth to cut faster, last longer and maximize your productivity on cordless saws ### Categories: Home > Products > Tool inserts > Saw blades- - - ### FEATURES:Features Hilti’s ultimate circular saw blades for wood framing, engineered to help you get the job done faster and cut more with the same blade Higher speed, lower vibration – 24 high-density carbide teeth help to saw rapidly and smoothly through timber framing Faster cuts with cordless saws – cut wood framing up to 30% faster by combining these blades with your Hilti cordless circular saw Designed for straight cuts – this framing blade is ideal when you want faster progress in rip, cross or even in bevel cuts More cuts per charge – ultra-thin kerf minimizes energy consumption so you can cut up to 40% more per battery charge Applications Cutting lumber, construction timber, solid wood (hard and soft) Cutting wooden boards (plywood, formwork, OSB, chip) Rip- and cross-cutting Bevel cuts ### TECHNICAL DATA: Blade features: Special for cordless, Long life, Ultra thin kerf technology, Carbide tipped, Straight cut Number of teeth: 24 Product Class: Ultimate Technical Data | Blade features | Special for cordless, Long life, Ultra thin kerf technology, Carbide tipped, Straight cut | Number of teeth | 24 | Product Class | Ultimate ### ITEMS- 2335648 - Circ. saw blade SCBW FR SPX 6-1/2 A (5) - Package Size 5 pc - 2335649 - Circ. saw blade SCBW FR SPX 7-1/4 A (5) - Package Size 5 pc - 3876788 - Circ. Saw FR SPX 7-1/4 Gen 2 (25) - Package Size 1 pc",
  "tag_name": "Wood framing circular saw blade",
  "tag_description": "Top-performance circular saw blade for wood framing with carbide teeth to cut faster, last longer and maximize your productivity on cordless saws",
  "tag_source": "HOL: Products",
  "tag_author": "na",
  "tag_created_at": "na",
  "tag_ingestion_date": "2025-05-20T12:12:25.206134",
  "tag_categories_leaf": "Saw blades",
  "tag_categories_branch": "Home > Products > Tool inserts > Saw blades",
  "tag_item_numbers": "['2335648', '2335649', '3876788']",
  "tag_related_files": "[{'category': 'Operating Instruction', 'url': 'https://productdata.hilti.com/APQ_HC_RAW/PUB_5638597_000.pdf', 'description': 'Download OI, leafletwood - Safety Instr_web'}]",
  "tag_sidelinks": "na",
  "tag_language": "en",
  "tag_country": "us",
  "tag_keywords": "na",
  "tag_page_number": "na",
  "tag_sku": "r8024490",
  "tag_file_type": "product_page",
  "tag_file_extension": "html"
}